import random

def small_bg_random():
    """小窗口背景图随机

    根据储存的背景图文件名，返回随机的小背景图

    Returns:
        random.choice(small_bg_list): 随机的一张背景图名
    """
    small_bg_list = ["48785626.png", "76182830.png", "79270076_46.jpg", "79630371.jpg", 
                "79766498.png", "82730039.png", "82651099.png", "82778068.png", 
                "82788872.png","82977478.png", "83408932(1).png", "83980327.png",
                "85057160_p0.png", "85102162_p0.png",
                #第二期背景图
                "27421218.png", "50489348.jpg", "54968155.jpg", "63511691.png", "65646343.jpg",
                "68068733_18.png", "68068733_19.png", "68485858_30.png", "69076928_14.png",
                "69076928_19.png", "69485543_14.png", "73440912.jpg", "75746571.png",
                #第三期背景图
                "63261643_p0.jpg", "73796140_p0.jpg", "74990422_p0.png", "75689551_p2.jpg",
                "88605301_p0.jpg", "89286311_p0.jpg", "89920989_p0.jpg", "90436688_p23.jpg",
                "90722077_p0.png",
                #v2.1背景图
                "hutao.jpg", "hutao2.jpg", "hutao3.jpg", "hutao4.jpg"]
    return random.choice(small_bg_list)

